---
title: WireTypeSet
classe: Autodesk.Revit.DB.Electrical.WireTypeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# WireTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `wireTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `wireTypeSet.Size` | Int32 |
| `Void Clear()` | `wireTypeSet.Clear()` | Void |
| `Boolean Contains(WireType)` | `wireTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(WireType)` | `wireTypeSet.Erase(item)` | Int32 |
| `WireTypeSetIterator ForwardIterator()` | `wireTypeSet.ForwardIterator()` | WireTypeSetIterator |
| `IEnumerator GetEnumerator()` | `wireTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(WireType)` | `wireTypeSet.Insert(item)` | Boolean |
| `WireTypeSetIterator ReverseIterator()` | `wireTypeSet.ReverseIterator()` | WireTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```